layer {
  name: "data_d24"
  type: "Data"
  top: "data_d24"
  top: "label_d24"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 24
    mean_file: "/usr/share/digits/digits/jobs/20160201-194145-fb09/mean.binaryproto"
  }
  data_param {
    source: "/usr/share/digits/digits/jobs/20160201-194145-fb09/train_db"
    batch_size: 16
    backend: LMDB
  }
  image_data_param {
    batch_size: 256
    shuffle: true
    new_height: 24
    new_width: 24
  }
}
layer {
  name: "data_d24"
  type: "Data"
  top: "data_d24"
  top: "label_d24"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 24
    mean_file: "/usr/share/digits/digits/jobs/20160201-194145-fb09/mean.binaryproto"
  }
  data_param {
    source: "/usr/share/digits/digits/jobs/20160201-194145-fb09/val_db"
    batch_size: 16
    backend: LMDB
  }
  image_data_param {
    batch_size: 50
    new_height: 24
    new_width: 24
  }
}
layer {
  name: "conv1_d24"
  type: "Convolution"
  bottom: "data_d24"
  top: "conv1_d24"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1_d24"
  type: "Pooling"
  bottom: "conv1_d24"
  top: "pool1_d24"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu1_d24"
  type: "ReLU"
  bottom: "pool1_d24"
  top: "pool1_d24"
}
layer {
  name: "fc1_d24"
  type: "InnerProduct"
  bottom: "pool1_d24"
  top: "fc1_d24"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_d24"
  type: "ReLU"
  bottom: "fc1_d24"
  top: "fc1_d24"
}
layer {
  name: "fc2_d24"
  type: "InnerProduct"
  bottom: "fc1_d24"
  top: "fc2_d24"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_d24"
  type: "SoftmaxWithLoss"
  bottom: "fc2_d24"
  bottom: "label_d24"
  top: "loss_d24"
}
layer {
  name: "accuracy_d24"
  type: "Accuracy"
  bottom: "fc2_d24"
  bottom: "label_d24"
  top: "accuracy_d24"
  include {
    phase: TEST
  }
}
