layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "/usr/share/digits/digits/jobs/20160212-194349-2ccb/mean.binaryproto"
  }
  data_param {
    source: "/usr/share/digits/digits/jobs/20160212-194349-2ccb/train_db"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "/usr/share/digits/digits/jobs/20160212-194349-2ccb/mean.binaryproto"
  }
  data_param {
    source: "/usr/share/digits/digits/jobs/20160212-194349-2ccb/val_db"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "scale"
  type: "Power"
  bottom: "data"
  top: "scale"
  power_param {
    scale: 0.0125000001863
  }
}
layer {
  name: "conv1_d12"
  type: "Convolution"
  bottom: "scale"
  top: "conv1_d12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 4
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1_d12"
  type: "Pooling"
  bottom: "conv1_d12"
  top: "pool1_d12"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "relu1_d12"
  type: "ReLU"
  bottom: "pool1_d12"
  top: "pool1_d12"
}
layer {
  name: "fc1_d12"
  type: "InnerProduct"
  bottom: "pool1_d12"
  top: "fc1_d12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_d12"
  type: "ReLU"
  bottom: "fc1_d12"
  top: "fc1_d12"
}
layer {
  name: "drop1_d12"
  type: "Dropout"
  bottom: "fc1_d12"
  top: "fc1_d12"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc2_d12"
  type: "InnerProduct"
  bottom: "fc1_d12"
  top: "fc2_d12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc2_d12"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc2_d12"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
